{% macro random_first_name (
       entity_fq,
       header,
        debug = false
       ) %}

{# dummy variable #}
{% set get_kwargs = kwargs %}       
{% set sql %}
{{ header }} {{entity_fq }}()
returns string
language sql
as
$$
        select split('
        אבי,
        אביגדור,אבידן,אביה,אביחיל,אבינועם,אביר,אבירן,אבישי,אביתר,אברי,אבשלום,אדוארד,אדור,אדיר,אדמונד,אהוד,אוליבר,אומרי,אופק,אופרי,
        אור אל,אור-חיים,אוראן,אוריאן,אורלב,אורן,אורעד,אורפז,אושיק,אושרי,אחיה,אחיקם,איוב,איילון,אייר,אילון,אילעאי,איציק,איתי,איתם,
        איתן,אלאור,אלדור,אלדן,אלדר,אלחנן,אליאם,אלידור,אלידע,אליה,אליהב,אליוט,אליחי,אלימלך,אליעזר,אליק,אליקים,אלירוי,אלירז,אלירם,
        אלישי,אלישיב,אלכס,אלמוג,אלן,אלעאי,אלעד,אלעי,אלקנה,אלראי,אלרוי,אלרז,אלתר,אמור,אמיר,אמית,אמנון,אמציה,אנדי,אנדרי,
        אנדריי,אנטון,אסי,אסף,אפרים,אראל,ארז,ארטיום,ארי,אריה,ארמון,ארן,ארנון,אשחר,אשכול,אשל,אשר,אתמר,בארי,בונים,
        בונם,בנו,בני,בנייה,בר,בראל,ברוך,ברוק,ברי,ברנרד,גאל,גבי,
        גבע,גדליה,גדליהו,גולן,גון,גונן,גור,גורגי,גורי,גיא,גידי,גיורא,גל,גלבוע,גליל,גלעד,דדו,דובב,דובער,דודו,
        דורון,דורי,דוריאן,דייויד,דילן,דן,דניאל,דניס,דקל,הארי,הילאי,הרי,הרן,ויטוריו,ולדימיר,ולדיסלב,זאב,זושא,זיו,זמיר,
        חביב,חבר,חובב,חופי,חזי,חזקיהו,חי,חנן,חננאל,חנניה,חשן,טבע,טדי,טהר,טובאל,טוהר,טום,טוני,טים,טל,
        טלאור,יאיר,יאן,יאסו,יבגני,יגאל,ידידיה,ידין,יהב,יהודא,יהונדב,יהורם,יהושע-שי,יהלום,יהלי,יוגב,יוחנן,יונדב,יונתן,יוסי,
        יוסף-חיים,יורי,יזהר,יחיא,יחיאל,יינון,ים,יניב,יעיש,יעקב,יעקב-קובי,יער,יערי,יפת,יצהר,יצחק-צחי,יקותיאל,ירון,ירמיהו,ישכר,
        יתיר,כתריאל,לאונרד,לאונרדו,לאור,לביא,לואי,לוקאס,לורן,לי,לי-ים,ליאו,ליאון,ליאל,לידן,ליהוא,ליו,לייב,ליים,ליעוז,
        ליעם,ליר,לירום,לירון,לירן,לישי,לשם,מאור,מבשר,מגן,מוטי,מור,מורדי,מורי,מוריאל,מוריס,מורן,מושיק,מיאל,מידד,
        מידן,מיילו,מיכאל,מיכל,מיתר,מלאכי,מנדי,מנדל,מסעוד,מעיין,מקסים,מרדכי,מרום,מתאו,מתן,מתן-אל,נאור,נבות,נדב,נדיר,
        נוב,נוה,נוהר,נוף,נור,נחום,נחמן,נחשון,ניב,ניגון,ניסים,ניסן,ניק,ניקו,ניר,נירן,נמרוד,נס,נסי,נעים,
        נעמן,נרקיס,נתיב,נתנאל,נתניאל,סאן,סאני,סטיב,סימן,סיני,סלמון,סמואל,סנדר,סער,ספיר,עברי,עדיאל,עוז,עומר,עזי,
        עזר,עזריה,עידן,עיטם,עילאיי,עיליי,עירן,עמוס,עמיעד,עמנואל,עמרן,ענר,עצמון,עקיבא,ערד,עשור,עתאי,פאר,פיטר,פלג,
        פסח,פרדי,פרי,פתחיה,צביאל,צבר,צדוק,צח,צחי,צחי-יצחק,ציון,צמח,צפניה,קאי,קדם,קובי,קוה,קווין,קורן,
        קינן,קסם,ראיין,ראם,רביב,רואי,רובין,רוגל,רוי,רויאל,רום,רומי,רון,רונאל,רועה,רועי,ריבר,ריו,ריי,רייאן,
        ריילי,רימון,ריף,רני,רעם,רענן,רפאל,רשף,שגב,שגיב,שובאל,שוהם,שון,שוקי,שושן,שחר,שי-יהושע,שי-שמואל,שייקה,שימי,
        שיראל,שלום,שלומי,שליו,שלמי,שם,שמואל-שי,שמי,שמעון,שמריהו,שמשון,שקד,שר,שרגא,שרון,שריאל,תאיר,תבל,תהל,תובל,
        תום,תומא,תומאס,תיאו,תיאודור,אבגיל,אבישג,אבלין,אדוה,אדית,אדלה,אדלין,אדריאנה,אודאל,אודל,אוליביה,אוניל,אופיר,אופק,אור-טל,
        אור-יה,אורה,אורי,אורייה,אורלב,אורלי,אורליה,אורלין,אורן,אורנית,אושרית,אחווה,אטי,איב,איזבל,איזבלה,איטה,איידי,אייל,איילת,
        השחר",אילאיל,אילון,אילונה,אילור,איליי,אילנית,אימרי,אירן,איתי,אלבי,אלגרה,אלגריה,אלון,אלונית,אלטא,אלטע,אליאור,אליז,אלינוי,
        אליסה,אליענה,אלכסה,אלמה,אלמוג,אלנית,אלקה,אמבר,אמה,אמי,אמילי,אמלי,אמן,אמרי,אנאל,אנני,אסי,אסיה,אסיף,
        אפיק,אפריל,אראלה,ארד,ארי,אריא,אריאלה,אריאנה,ארינה,ארנונה,אשחר,אתאל,אתל,באר,באשא,באשע,בהירה,בטי,ביאטריס,ביאנה,
        ביילה,בילה,בילי,בינה,בלה,בלן,ברטה,ברי,ברית,ברכה,בת,בת אור,בת-ציון,בתאל,בתשבע,גאלדא,
        גבע,גבריאלה,גוטא,גולדה,גולדי,גוליה,גולן,גיטי,גילי,גילת,גינת,גלאור,גלילה,דבורה,דגנית,דוראל,דורה,דוריאן,דורית,דיאן,
        דינה,דנה,דני,דניה,דניס,דנית,דפנה,דר,דרורה,הדסה,הדרה,הוד,הודאל,היאלי,היווט,הילדה,הילי,היליי,הינדא,הינדי,
        הלל,הללי,הלליה,הלני,הענא,הענטשא,העני,העניא,הרצליה,ויוי,ויולט,ויטל,ויקטוריה,ולרי,ולריה,וקטוריה,ורד,ורדה,ורה,ורוניקה,
        זאבה,זהבה,זהבית,זהרה,זואי,זוהר,זוהרית,זיו,זמר,זנט,חביבה,חגית,חדוה,חוה,חווה,חושן,חיה,חייה,חיננית,חמוטל,
        חניתה,חרות,טבע,טובי,טובית,טוהר,טויבא,טויבע,טום,טוני,טיגיסט,טיראנה,טירנה,טל,טנא,טניה,יאירה,יאלי,יאן,יגל,
        יהודית,יהלי,יואלה,יוטה,יוטל,יוכי,יולי,יולנדה,יונה,יונית,יונת,יוספה,יטל,ילי,ימית,ינאי,ינית,יעל,יעלי,יעלת חן,
        יענטא,יערה,יקירה,ירדנה,ירושלמית,ירין,כוכבא,כחל,כינרת,כליל,כלנית,כרם,כרמית,כרמלה,לאה,לאיה,לבונה,לבנה,לוטן,לויה,
        לולה,לונה,לור,לוריא,לורין,לחן,לטם,לי,לי אל,לי-אור,לי-אל,ליאה,ליאורה,ליאל,ליאנה,ליאת-לאה,ליבה,ליבי,ליבר,ליבת,
        לידור,לידיה,לידר,ליז,ליזה,ליזט,ליילה,לילה,ליליאן,לילך,לימאי,לימור,לינדה,לינס,ליקה,לירוז,לירוי,לירז,לירית,לירן,
        לנה,לני,לריאן,מאורי,מאטיל,מאטל,מאילי,מאל,מארי,מבשרת,מגי,מגל,מדלן,מונה,מוסיא,מוריאל,מורין,מורל,מורשה,מושית,
        מזי,מזל,מזמור,מטי,מטילדה,מטר,מיא,מיי,מיילי,מיכלי,מילאן,מילה,מינדי,מיקי,מירה,מירי,מירל,מישל,מיתר,מליסה,
        מלכות,מלכי,מלני,מנואל,מנוחה,מרגלית,מרום,מרים,מרין,מרינה,מרסל,מרצדס,נאורה,נאיה,נדין,נהורה,נהר,נואל,נויאל,נוייה,
        נוף,נופית,נופר,נור,נוריה,נורית,נטאלי,נטליה,נטע-לי,נטעלי,ניבר,ניסל,ניצה,ניצחיה,ניצן,ניצנה,ניצנית,ניר,נל,נס,
        נסיה,נסלי,נעמי,נעמית,נצה,נצחיה,נרדוס,נרדית,נתנאל,סאן,סביון,סברינה,סגולה,סוזי,סולטנה,סופה,סופיה,סטפני,סיאל,סיטאר,
        סילביה,סימה,סימון,סימונה,סיני,סיניה,סלם,סנאית,סנדרה,סער,ספי,עדן,עומרי,עופר,עופרי,עורי,עטא,עטי,עטיל,עטל,
        עטר,עטרה,עטרת,עילאי,עילית,עימנואל,עינה,עינת,עליה,עליזה,עלקא,עמירה,עמית,עמליה,עמנואל,ענבל,ענהאל,ענת,פאולה,פולי,
        פורטונה,פזית,פיבי,פיגא,פיגה,פסי,פסיה,פעסיא,פערי,פעריל,פקר,פראדל,פרח,פרחה,פרחיה,פרי,פריאל,פרידא,פריידא,פריידי,
        פריידל,פרלה,צוף,צופית,צוקית,צורי,צורית,צחית,ציפא,ציפי,צירל,צפנת,צפרירה,צרי,קאיה,קארינה,קארן,קדם,קורל,קטיה,
        קיארה,קייט,קילא,קים,קירה,קלודין,קליה,קמה,קמילה,קסם,קרולין,קרין,קרני,קשת,ראדא,ראומה,רווית,רוז,רוזלין,רויזא,
        רוית,רונית,רותי,רותם,רזיה,רחל,רחמה,ריבה,רייזא,רייזי,רייזיל,ריין,רימונה,רינתיה,ריקל,רמונה,רנית,רעיה,רפאל,שאנל,
        שגית,שובי,שובל,שוהם,שולי,שושי,שושן,שחק,שטערנא,שטרנא,שי,שי-יה,שיה,שייה,שיינדל,שיינה,שילב,שילה,שינא,שינדל,
        שירה,שירז,שירית,שירל,שירלי,שירת,שלהבת,שלומית,שלומציון,שמרית,שנהב,שנטל,שני,שנית,שר,שרונית,שרין,שריתה,שרלין,תאה,
        תאיה,תבל,תהלה,תהלי,תיאה,תיקי,תלמה,תמי,תמרי', ',')
        [abs(random())%976]::string

$$;
{% endset %}
{{ log(fromyaml(sql), info = true) if debug == 1 }}
{{ return (sql) }}
{%- endmacro -%}
